tutorials/solvers/overInterPlicPhaseChangeDyMFoam/twoSimpleRotors/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs            (overset fvMotionSolvers);

DebugSwitches
{
    overset                 0;
    dynamicOversetFvMesh    0;
    cellVolumeWeight        0;
}

application     overInterPlicPhaseChangeDyMFoam;

startFrom       latestTime;
startTime       0.0;
stopAt          endTime;
endTime         0.1;
deltaT          0.00001;

writeControl    adjustable;
writeInterval   0.02;
purgeWrite      0;
writeFormat     binary;
writePrecision  12;
writeCompression off;

timeFormat      general;
timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;
maxCo           0.5;
maxAlphaCo      0.5;
maxDeltaT       1;


functions
{
    plicInterface
    {
        type            surfaces;
        libs            (SimPLIC sampling);
        writeControl    adjustableRunTime;
        writeInterval   0.02;

        surfaceFormat   vtp;
        fields          ( alpha.water U p p_rgh volZoneID cellMask interpolatedCells );

        interpolationScheme cell;

        surfaces
        (
            plicSurf
            {
                type            plicSurface;
                interpolate     false;
            }
        );
    }

    isoInterface
    {
        type                surfaces;
        libs                (sampling);
        writeControl        adjustableRunTime;
        writeInterval       0.0002;

        surfaceFormat       vtp;
        fields              ( alpha.water U p p_rgh volZoneID cellMask interpolatedCells );

        interpolationScheme cellPoint;

        surfaces
        (
            isoSurf
            {
                type        isoSurfaceTopo;
                isoField    alpha.water;
                isoValue    0.5;
                interpolate true;
            }
        );
    }

    rotors
    {
        type                surfaces;
        libs                (sampling);
        writeControl        adjustableRunTime;
        writeInterval       0.0002;

        surfaceFormat       vtp;
        fields              (p U alpha.water);

        interpolationScheme cellPoint;  //<- default

        surfaces
        {
            rotors
            {
                type            patch;
                patches         (hole);
                interpolate     false;
                triangulate     false;
            }
        }
    }

    zPlaneCut
    {
        $rotors;

        fields              ( alpha.water U p p_rgh volZoneID cellMask interpolatedCells );

        surfaces
        (
            face1
            {
                type            cuttingPlane;
                planeType       pointAndNormal;
                pointAndNormalDict
                {
                    point       (0.01 0.005 0.005);
                    normal      (0 0 1);
                    interpolate false;
                }
            }
        );
    }

    probes
    {
        type            probes;
        libs            (sampling);

        // Name of the directory for probe data
        name            probes;

        // Write at same frequency as fields
       writeControl     adjustableRunTime;
        writeInterval   0.0002;

        // Fields to be probed
        fields          (p U);

        // Optional: interpolation scheme to use (default is cell)
        interpolationScheme cell;

        probeLocations
        (
             (0.0009999 0.0015 0.003)
        );
    }
}

// ************************************************************************* //
